#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_bastion_host.bastionHost will be created
  + resource "azurerm_bastion_host" "bastionHost" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "westus2"
      + name                   = "snet-basthost-sec-baseline-sgl-dev-westus2-001"
      + resource_group_name    = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "IpConf"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_private_dns_a_record.privateDnsZoneName_Amp will be created
  + resource "azurerm_private_dns_a_record" "privateDnsZoneName_Amp" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = [
          + "10.1.1.4",
        ]
      + resource_group_name = "rgtf-ase-sec-baseline-sgl-dev-westus2-001"
      + ttl                 = 3600
      + zone_name           = "ase-sec-baseline-sgl-dev-westus2-001.appserviceenvironment.net"
    }

  # azurerm_private_dns_a_record.privateDnsZoneName_all will be created
  + resource "azurerm_private_dns_a_record" "privateDnsZoneName_all" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + records             = [
          + "10.1.1.4",
        ]
      + resource_group_name = "rgtf-ase-sec-baseline-sgl-dev-westus2-001"
      + ttl                 = 3600
      + zone_name           = "ase-sec-baseline-sgl-dev-westus2-001.appserviceenvironment.net"
    }

  # azurerm_private_dns_a_record.privateDnsZoneName_scm will be created
  + resource "azurerm_private_dns_a_record" "privateDnsZoneName_scm" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*.scm"
      + records             = [
          + "10.1.1.4",
        ]
      + resource_group_name = "rgtf-ase-sec-baseline-sgl-dev-westus2-001"
      + ttl                 = 3600
      + zone_name           = "ase-sec-baseline-sgl-dev-westus2-001.appserviceenvironment.net"
    }

  # azurerm_private_dns_zone.privateDnsZone will be created
  + resource "azurerm_private_dns_zone" "privateDnsZone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "ase-sec-baseline-sgl-dev-westus2-001.appserviceenvironment.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgtf-ase-sec-baseline-sgl-dev-westus2-001"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # azurerm_private_dns_zone_virtual_network_link.privateDnsZoneName_vnetLink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "privateDnsZoneName_vnetLink" {
      + id                    = (known after apply)
      + name                  = "vnetLink"
      + private_dns_zone_name = "ase-sec-baseline-sgl-dev-westus2-001.appserviceenvironment.net"
      + registration_enabled  = false
      + resource_group_name   = "rgtf-ase-sec-baseline-sgl-dev-westus2-001"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_public_ip.bastionHostPippublicIp will be created
  + resource "azurerm_public_ip" "bastionHostPippublicIp" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus2"
      + name                    = "snet-basthost-sec-baseline-sgl-dev-westus2-001-pip"
      + resource_group_name     = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_resource_group.aserg will be created
  + resource "azurerm_resource_group" "aserg" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = "rgtf-ase-sec-baseline-sgl-dev-westus2-001"
    }

  # azurerm_resource_group.networkrg will be created
  + resource "azurerm_resource_group" "networkrg" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
    }

  # azurerm_resource_group.sharedrg will be created
  + resource "azurerm_resource_group" "sharedrg" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
    }

  # azurerm_service_plan.appServicePlan will be created
  + resource "azurerm_service_plan" "appServicePlan" {
      + app_service_environment_id   = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rgtf-ase-sec-baseline-sgl-dev-westus2-001/providers/Microsoft.Web/hostingEnvironments/ase-sec-baseline-sgl-dev-westus2-001"
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westus2"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "asp-sec-baseline-sgl-dev-westus2-001"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rgtf-ase-sec-baseline-sgl-dev-westus2-001"
      + sku_name                     = "I1v2"
      + worker_count                 = 3
      + zone_balancing_enabled       = true
    }

  # azurerm_subnet.vnetSpokeSubnet will be created
  + resource "azurerm_subnet" "vnetSpokeSubnet" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "snet-ase-sec-baseline-sgl-dev-westus2-001"
      + resource_group_name                            = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
      + virtual_network_name                           = "vnet-spoke-sec-baseline-sgl-dev-westus2-001"

      + delegation {
          + name = "hostingEnvironment"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Web/hostingEnvironments"
            }
        }
    }

  # azurerm_virtual_network.vnetHub will be created
  + resource "azurerm_virtual_network" "vnetHub" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "vnet-hub-sec-baseline-sgl-dev-westus2-001"
      + resource_group_name = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
      + subnet              = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "AzureBastionSubnet"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "CICDAgentSubnetName"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.3.0/24"
              + id             = (known after apply)
              + name           = "jumpBoxSubnetName"
              + security_group = ""
            },
        ]
    }

  # azurerm_virtual_network.vnetSpoke will be created
  + resource "azurerm_virtual_network" "vnetSpoke" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "vnet-spoke-sec-baseline-sgl-dev-westus2-001"
      + resource_group_name = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
      + subnet              = (known after apply)
    }

  # azurerm_virtual_network_peering.peerhubtospoke will be created
  + resource "azurerm_virtual_network_peering" "peerhubtospoke" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peerhubtospoke"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
      + use_remote_gateways          = false
      + virtual_network_name         = "vnet-hub-sec-baseline-sgl-dev-westus2-001"
    }

  # azurerm_virtual_network_peering.peerspoketohub will be created
  + resource "azurerm_virtual_network_peering" "peerspoketohub" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peerspoketohub"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rgtf-networking-sec-baseline-sgl-dev-westus2-001"
      + use_remote_gateways          = false
      + virtual_network_name         = "vnet-spoke-sec-baseline-sgl-dev-westus2-001"
    }

  # module.shared-vms.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.shared-vms.azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westus2"
      + name                                  = "insights-shared-sec-baseline-sgl-dev-westus2-001"
      + resource_group_name                   = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.shared-vms.azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy               = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "Get",
                  + "List",
                  + "Update",
                ]
              + object_id               = (known after apply)
              + secret_permissions      = [
                  + "Get",
                  + "Set",
                  + "List",
                  + "Recover",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = [
                  + "Get",
                  + "Set",
                  + "Update",
                ]
              + tenant_id               = (known after apply)
            },
        ]
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "westus2"
      + name                        = "kv-shared-sec-baseline-s"
      + purge_protection_enabled    = false
      + resource_group_name         = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
      + sku_name                    = "standard"
      + soft_delete_retention_days  = 7
      + tenant_id                   = "449fbe1d-9c99-4509-9014-4fd5cf25b014"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.shared-vms.azurerm_key_vault_secret.devopsvm_password[0] will be created
  + resource "azurerm_key_vault_secret" "devopsvm_password" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "asedevopsvm"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.shared-vms.azurerm_key_vault_secret.jumpboxvm_password[0] will be created
  + resource "azurerm_key_vault_secret" "jumpboxvm_password" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "asejumpboxvm"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.shared-vms.azurerm_log_analytics_workspace.loganalytics will be created
  + resource "azurerm_log_analytics_workspace" "loganalytics" {
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + location                           = "westus2"
      + name                               = "log-shared-sec-baseline-sgl-dev-westus2-001"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # module.shared-vms.random_password.password[0] will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.shared-vms.random_password.password[1] will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.shared-vms.module.devopsvm.azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus2"
      + mac_address                   = (known after apply)
      + name                          = "asedevopsvm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.shared-vms.module.devopsvm.azurerm_windows_virtual_machine.vm will be created
  + resource "azurerm_windows_virtual_machine" "vm" {
      + admin_password             = (sensitive value)
      + admin_username             = "vmadmin"
      + allow_extension_operations = true
      + computer_name              = (known after apply)
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + hotpatching_enabled        = false
      + id                         = (known after apply)
      + location                   = "westus2"
      + max_bid_price              = -1
      + name                       = "asedevopsvm"
      + network_interface_ids      = (known after apply)
      + patch_mode                 = "AutomaticByOS"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
      + size                       = "Standard_F2"
      + virtual_machine_id         = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2016-Datacenter"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.shared-vms.module.jumpboxvm.azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus2"
      + mac_address                   = (known after apply)
      + name                          = "asejumpboxvm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.shared-vms.module.jumpboxvm.azurerm_windows_virtual_machine.vm will be created
  + resource "azurerm_windows_virtual_machine" "vm" {
      + admin_password             = (sensitive value)
      + admin_username             = "vmadmin"
      + allow_extension_operations = true
      + computer_name              = (known after apply)
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + hotpatching_enabled        = false
      + id                         = (known after apply)
      + location                   = "westus2"
      + max_bid_price              = -1
      + name                       = "asejumpboxvm"
      + network_interface_ids      = (known after apply)
      + patch_mode                 = "AutomaticByOS"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "rgtf-shared-sec-baseline-sgl-dev-westus2-001"
      + size                       = "Standard_F2"
      + virtual_machine_id         = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2016-Datacenter"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + appServicePlanId   = (known after apply)
  + appServicePlanName = "asp-sec-baseline-sgl-dev-westus2-001"
  + aseId              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rgtf-ase-sec-baseline-sgl-dev-westus2-001/providers/Microsoft.Web/hostingEnvironments/ase-sec-baseline-sgl-dev-westus2-001"
  + aseName            = "ase-sec-baseline-sgl-dev-westus2-001"
  + hubSubnets         = {
      + AzureBastionSubnet  = (known after apply)
      + CICDAgentSubnetName = (known after apply)
      + jumpBoxSubnetName   = (known after apply)
    }
  + hubVNetId          = (known after apply)
  + hubVNetName        = "vnet-hub-sec-baseline-sgl-dev-westus2-001"
  + shared-vms         = {
      + devopsvm  = {
          + id                 = (known after apply)
          + private_ip_address = (known after apply)
        }
      + jumpboxvm = {
          + id                 = (known after apply)
          + private_ip_address = (known after apply)
        }
    }
  + spokeVNetId        = (known after apply)
  + spokeVNetName      = "vnet-spoke-sec-baseline-sgl-dev-westus2-001"

```

</details>

*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-ase/terraform`, Workflow: `Single-tenant ASEv3 Secure Baseline: Terraform Deploy`*